app/views/books/index.html.erb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <td><%= book.title %></td>
        <%= link_to  book.author.firstname + ' ' + book.author.name,  book.author, class: "btn_user" %>