app/views/books/show.html.erb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>Author:</strong>
  <%= @book.author.firstname + ' ' + @book.author.name %>