app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "firstname", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Saint"], ["firstname", "Jennifer"], ["created_at", "2023-10-18 19:38:26.728365"], ["updated_at", "2023-10-18 19:38:26.728365"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save