app/controllers/books_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
---
  def new
    if params[:author_id]
      @author = Author.find(params[:author_id])
      @book = @author.books.build
    else
      @book = Book.new
    end
    @authors = Author.all

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
---
  def edit
    @book = Book.find(params[:id])
    @authors = Author.all

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "books" ("title", "summary", "quote", "cover", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Éclats dormants"], ["summary", ""], ["quote", ""], ["cover", ""], ["created_at", "2023-10-18 21:50:09.730789"], ["updated_at", "2023-10-18 21:50:09.730789"], ["author_id", 2]]
---
  def create
    if params[:author_id]
      @author = Author.find(params[:author_id])
      @book = @author.books.build(book_params)
    else
      @book = Book.new(book_params)
    end

    respond_to do |format|
      if @book.save

UPDATE "books" SET "cover" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["cover", "https://i.ibb.co/cJyV7Rz/2ec12607144426cbc34223db0685111dd049c65e8e726ef8bd727e3416ae7669.jpg"], ["updated_at", "2023-10-18 22:01:48.715485"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)